Core/src/InformationRegisters/ПМ_РозничныеПродажи/ПМ_РозничныеПродажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПМ_РозничныеПродажи</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>КассаККМ</name>
    <type>
      <types>CatalogRef.КассыККМ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОбмена</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура_Код</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура_Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ЕдиницаИзмерения_Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/InformationRegisters/ПМ_РозничныеПродажи_Оплата/ПМ_РозничныеПродажи_Оплата.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПМ_РозничныеПродажи_Оплата</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>КассаККМ</name>
    <type>
      <types>CatalogRef.КассыККМ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОбмена</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МетодОплаты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/HTTPServices/shopapi/Module.bsl
//paymentmethod": "1 = cash, 2 = CARD, 3 = wolt, 4 = glovo"
//Пример запроса
//localhost/DirectOne/hs/shopapi/v1/?shopid=001
//Пример вызова: localhost/DirectOne/hs/shopapi/v1/?shopid=001&date=01/07/2019&passw=2
Функция getdatapost(Запрос) 
	Ответ=Новый HTTPСервисОтвет(200);
	
	ТелоЗапроса = РаскодироватьСтроку(Запрос.ПолучитьТелоКакСтроку(), СпособКодированияСтроки.КодировкаURL);
	КодРМ = Запрос.ПараметрыЗапроса.Получить("shopid");
	ДатаОбмена=Запрос.ПараметрыЗапроса.Получить("date");
	Пароль = Запрос.ПараметрыЗапроса.Получить("passw");
	
	Если НЕ ЗначениеЗаполнено(ДатаОбмена) Тогда
	  Ответ.КодСостояния = 401;
		СтрОтвет=НСтр("ka='დაკარგული პარამეტრი &date';ru='Отсутствует параметр &date';en='No & date option'");
    Ответ.УстановитьТелоИзСтроки(СтрОтвет, КодировкаТекста.UTF8);
		Возврат Ответ;	
	КонецЕсли; 

	//ПараметрыТела = СтроковыеФункцииКлиентСервер.ПолучитьПараметрыИзСтроки(ТелоЗапроса, "&");
	
	КассаККМ=ПолучитьРМ(КодРМ, пароль);
	Если НЕ ЗначениеЗаполнено(КассаККМ) Тогда
	  Ответ.КодСостояния = 404;
		СтрОтвет=НСтр("ru='Отсутствует ККМ с кодом: ';ka='ობიექტის დაკარგვა: '");
    Ответ.УстановитьТелоИзСтроки(СтрОтвет + КодРМ, КодировкаТекста.UTF8);
		Возврат Ответ;	
	КонецЕсли; 
	
	СтруктураВхПараметров = Новый Структура;
	
	СтруктураВхПараметров.Вставить("ИмяМетода","shopapi");  
	
	//Метод запроса
	СтруктураВхПараметров.Вставить("МетодЗапроса",Запрос.HTTPМетод);
	
	//Тело запроса
	ЗапросОтКлиента = Запрос.ПолучитьТелоКакСтроку();
	СтруктураВхПараметров.Вставить("ТелоЗапроса",ЗапросОтКлиента);
	СтруктураВхПараметров.Вставить("КассаККМ",КассаККМ);
	СтруктураВхПараметров.Вставить("ДатаОбмена", ДатаОбмена);

	СтруктураОтвет = ПрочитатьДанные(СтруктураВхПараметров);
	
	Если СтруктураОтвет.Отработало Тогда 
	  Ответ.УстановитьТелоИзСтроки(СтруктураОтвет.ДанныеОтвета,КодировкаТекста.UTF8);
		
		ПараметрыОбмена = Новый Структура;
		ПараметрыОбмена.Вставить("КассаККМ", КассаККМ);		    
		ПараметрыОбмена.Вставить("ДатаОбмена", ДатаОбмена);
		
		ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
		ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ka='Заполнение номенклатуры поставщиков';ru='Заполнение номенклатуры поставщиков';en='Filling suppliers nomenclature'");
	  ПараметрыВыполнения.ЗапуститьВФоне=Истина;
		
		Результат = ДлительныеОперации.ВыполнитьВФоне("ПМ_РозничныеПродажи.ЗаполнитьНоменклатуруПоставщика", ПараметрыОбмена, ПараметрыВыполнения);

	Иначе
		Ответ.УстановитьТелоИзСтроки(СтруктураОтвет.ТекстОшибки,КодировкаТекста.UTF8);
	КонецЕсли;
	
	ВозвращаемНужныйФорматОтвета(Ответ,СтруктураОтвет);
	
	Возврат Ответ;
КонецФункции

//Получить удаленное рабочее место
Функция ПолучитьРМ(КодРМ, пароль=Неопределено)
	// Ищем кассу по коду и пароль серийный номер
	УстановитьПривилегированныйРежим(Истина);
	Запрос=Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КассыККМ.Ссылка,
	|	КассыККМ.СерийныйНомер
	|ИЗ
	|	Справочник.КассыККМ КАК КассыККМ
	|ГДЕ
	|	НЕ КассыККМ.ПометкаУдаления
	|	И КассыККМ.Код = &Код";
	Запрос.УстановитьПараметр("Код",СтроковыеФункцииКлиентСервер.ДополнитьСтроку(КодРМ, 9, "0"));
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
	  Если ЗначениеЗаполнено(Выборка.СерийныйНомер) И Выборка.СерийныйНомер<>пароль Тогда
		  Возврат Неопределено;
		КонецЕсли; 
		Возврат Выборка.Ссылка;	
	КонецЕсли; 
  Возврат Неопределено;
КонецФункции // ПолучитьУРМ()

#Область РаботаСДанными
//Получаем дату из входных параметров
Функция ПолучитьДатуВремяИзСтроки(ДатаВремя) Экспорт
	
	Результат = Неопределено;
	ДатаВремя = СтрЗаменить(ДатаВремя, "-", "");
	ДатаВремя = СтрЗаменить(ДатаВремя, ":", "");
	Если СтрДлина(ДатаВремя) - Найти(ДатаВремя, " ") = 5 Тогда // время в формате Ч:ММ:СС
		ДатаВремя = СтрЗаменить(ДатаВремя, " ", "0");
	ИначеЕсли Найти(ДатаВремя, "T") > 0 Тогда //время в формате ГГГГММДДTЧЧММСС
		ДатаВремя = СтрЗаменить(ДатаВремя, "T", "");
	Иначе // время в формате ЧЧ:ММ:СС
		ДатаВремя = СтрЗаменить(ДатаВремя, " ", "");
	КонецЕсли;
	
	ОписаниеТипа = Новый ОписаниеТипов("Дата");
	Результат = ОписаниеТипа.ПривестиЗначение(ДатаВремя);  // дата и время в виде "ГГГГММДДЧЧММСС"
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Результат = ОписаниеТипа.ПривестиЗначение(Лев(ДатаВремя, 8));  // только дата "ГГГГММДД"
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ФорматыОтвета
Процедура ВозвращаемНужныйФорматОтвета(Ответ,СтруктураОтвет) Экспорт
	
	Если СтруктураОтвет.Свойство("ФорматОтвета") Тогда 
		ФорматОтвета = СтруктураОтвет.ФорматОтвета;
	Иначе
		ФорматОтвета = "";
	КонецЕсли;	

	Если ВРег(ФорматОтвета) = Врег(ФорматОтветаJSON()) Тогда 
		Ответ.Заголовки.Вставить("Content-Type","application/json; charset=utf-8");
	Иначе 	
		Ответ.Заголовки.Вставить("Content-Type","text/html; charset=utf-8");
	КонецЕсли;
КонецПроцедуры

Функция ФорматОтветаJSON() Экспорт 
	Возврат "JSON";	
КонецФункции

//Заполняем структуру ответа
Процедура ЗаполнитьСтруктуруОтвета(СтруктураОтвет,КодОтвета,ТекстОшибки,Отработало,ДанныеОтвета) Экспорт
	СтруктураОтвет.КодОтвета 	= КодОтвета;
	СтруктураОтвет.ТекстОшибки	= ТекстОшибки;
	СтруктураОтвет.Отработало	= Отработало;
	СтруктураОтвет.ДанныеОтвета = ДанныеОтвета;	
КонецПроцедуры

#КонецОбласти

Функция ПрочитатьДанные(СтруктураВхПараметров) 
	СтруктураОтвет = Новый Структура("ДанныеОтвета,Отработало,ТекстОшибки,КодОтвета","",Истина,"",200);
	
	Если ВРег(СтруктураВхПараметров.МетодЗапроса) = ВРег("POST") Тогда
		
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(СтруктураВхПараметров.ТелоЗапроса);	
		Попытка
		 	МассивИмен = Новый Массив;
			МассивИмен.Добавить("orderdate");
			ТелоЗапросаJSON = ПрочитатьJSON(ЧтениеJSON,,,,"ВосстановлениеJSON",ПМ_РозничныеПродажи,,МассивИмен);
		Исключение
			//стрТекст=НСтр("ka='მონაცემების მიღება ვერ მოხერხდა!';ru='Не удалось получить данные!';en='Failed to get the data!'");
			стрТекст=ОписаниеОшибки();
			ЗаполнитьСтруктуруОтвета(СтруктураОтвет,400,стрТекст,Ложь,"");
		КонецПопытки;
		
		Если СтруктураОтвет.Отработало Тогда
			Если ТипЗнч(ТелоЗапросаJSON) = Тип("Массив") Тогда 
				//Записываем данные в регистр
				ЗаписатьДанныеВРегистр(СтруктураОтвет, ТелоЗапросаJSON, СтруктураВхПараметров.КассаККМ,СтруктураВхПараметров.ДатаОбмена);
			Иначе
				ЗаполнитьСтруктуруОтвета(СтруктураОтвет,
				400,"Передана не структура!",Ложь,"");
			КонецЕсли;	
		КонецЕсли;	
	Иначе
		ЗаполнитьСтруктуруОтвета(СтруктураОтвет,
		501,"Метод: "+СтруктураВхПараметров.МетодЗапроса+" не поддерживается!",Ложь,"");	
	КонецЕсли;
	
	Возврат СтруктураОтвет;
КонецФункции // ЗаписатьДанные()
 
Процедура ЗаписатьДанныеВРегистр(СтруктураОтвет, МассивДокументов, КассаККМ, Знач ДатаОбмена)
	УстановитьПривилегированныйРежим(Истина);
	ДатаОбмена=ПМ_РозничныеПродажи.ВосстановлениеJSON("ДатаОбмена",ДатаОбмена);
	ТекДата=ТекущаяДата();
	РегДокументы=РегистрыСведений.ПМ_РозничныеПродажи.СоздатьНаборЗаписей();
	РегДокументы.Отбор.КассаККМ.Установить(КассаККМ);
	РегДокументы.Отбор.ДатаОбмена.Установить(ДатаОбмена);
	РегДокументы.Очистить();
	
	РегОплаты=РегистрыСведений.ПМ_РозничныеПродажи_Оплата.СоздатьНаборЗаписей();
	РегОплаты.Отбор.КассаККМ.Установить(КассаККМ);
	РегОплаты.Отбор.ДатаОбмена.Установить(ДатаОбмена);
	РегОплаты.Очистить();
	
	тзДокументы=РегДокументы.ВыгрузитьКолонки();
	тзОплаты=РегОплаты.ВыгрузитьКолонки();
	
	Попытка
	
		Для каждого док Из МассивДокументов Цикл
			док_orderid=Формат(док.orderid,"ЧГ=0");
			Для каждого стр Из док.dishes Цикл
			  РегЗапись=тзДокументы.Добавить();
				РегЗапись.ДатаОбмена                = ДатаОбмена;
				РегЗапись.ДатаИзменения             = ТекДата;
			  РегЗапись.КассаККМ                  = КассаККМ;
				РегЗапись.НомерДокумента            = док_orderid;
				РегЗапись.Дата                      = док.orderdate;
				РегЗапись.Номенклатура_Наименование = стр.dishname;
				РегЗапись.Номенклатура_Код          = стр.dishid;
				РегЗапись.Количество                = стр.quantity;
				РегЗапись.Сумма                     = стр.quantity*стр.unitpriceprice;
				РегЗапись.ЕдиницаИзмерения_Наименование = стр.unit;
				РегЗапись.Комментарий               = стр.comment;
			КонецЦикла;
			Если док.Свойство("payments") Тогда
				Если ТипЗнч(док.payments)=Тип("Массив") Тогда
					//Передали массив
					Для каждого стр Из док.payments Цикл
					  РегЗапись=тзОплаты.Добавить();
						РегЗапись.ДатаИзменения = ТекДата;
					  РегЗапись.КассаККМ      = КассаККМ;
						РегЗапись.ДатаОбмена    = ДатаОбмена;
						РегЗапись.НомерДокумента= док_orderid;
						РегЗапись.Дата          = док.orderdate;
					  РегЗапись.МетодОплаты   = стр.paymentmethod;
					  РегЗапись.Сумма         = стр.price;
					КонецЦикла;
				Иначе
					РегЗапись=тзОплаты.Добавить();
					РегЗапись.ДатаИзменения=ТекДата;
				  РегЗапись.КассаККМ       = КассаККМ;
					РегЗапись.ДатаОбмена     = ДатаОбмена;
					РегЗапись.НомерДокумента = док_orderid;
					РегЗапись.Дата           = док.orderdate;
				  РегЗапись.МетодОплаты    = стр.paymentmethod;
				  РегЗапись.Сумма          = стр.price;
				КонецЕсли;	
			КонецЕсли;	
		КонецЦикла;
		тзДокументы.Свернуть("КассаККМ,ДатаОбмена,Номенклатура_Код,Номенклатура_Наименование,ЕдиницаИзмерения_Наименование,НомерДокумента,Дата","Количество,Сумма");
		тзДокументы.Колонки.Добавить("ДатаИзменения",ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
		ТзДокументы.ЗаполнитьЗначения(ТекДата,"ДатаИзменения");
		РегДокументы.Загрузить(тзДокументы);
		РегДокументы.Записать(Истина);                             
		
		тзОплаты.Свернуть("КассаККМ,ДатаОбмена,НомерДокумента,Дата,МетодОплаты","Сумма");
		тзОплаты.Колонки.Добавить("ДатаИзменения",ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
		тзОплаты.ЗаполнитьЗначения(ТекДата,"ДатаИзменения");
		РегОплаты.Загрузить(тзОплаты);
	  РегОплаты.Записать(Истина);
	Исключение
	  ЗаполнитьСтруктуруОтвета(СтруктураОтвет, 400,ОписаниеОшибки(),Ложь,"");
	КонецПопытки;
КонецПроцедуры

//Пример входящих данных
//[
//     {

//     "shopid": "1",

//     "orderid": "3468457",
//     "orderdate": "01/11/2018 16:17:33",
//     "payment":[
//     	{
//     "paymentmethod": "2",
//     "price": 18		
//     	}
//     ],
//          "dishes":[
//         {
//             "dishname": "შაურმა ღორის 8 წიწაკისა და ხახვის გარეშე",
//             "dishid": 76,
//             "quantity": 2,
//             "unitpriceprice": 8,
//             "unit":"шт",
//             "comment": "მეტი მაიონეზი, მეტი სალათი"
//         },
//         {
//             "dishname": "სასმელი",
//             "dishid": 43,
//             "quantity": 2,
//             "unitpriceprice": 1,
//             "unit":"шт",
//             "comment": ""
//         }
//     ]
//     },
//     {

//     "shopid": "1",

//     "orderid": "3468458",
//     "orderdate": "01/11/2018 16:22:12",
// "payment":[
//     	{
//     "paymentmethod": "1",
//     "price": 9		
//     	}
//     ],    
//     "dishes":[
//         {
//             "dishname": "შაურმა ღორის 8 წიწაკის, პომიდორის, სალათის, კეტჩუპის, მაიონეზის გარეშე",
//             "dishid": 33,
//             "quantity": 1,
//             "unitpriceprice": 8,
//             "unit":"шт",
//             "comment": ""
//         },
//         {
//             "dishname": "სასმელი",
//             "dishid": 43,
//             "quantity": 1,
//             "unitpriceprice": 1,
//             "unit":"кг",
//             "comment": ""
//         }
//     ]
//     }
//]
